# IsHeaderFrozen Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..IsHeaderFrozen Property
ViewSchedule Class See Also
---
A static property defining if the schedule header frozen setting is turned on or off in current Revit Application Session.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static bool IsHeaderFrozen { get; set; }
```

Visual Basic
---
```text
Public Shared Property IsHeaderFrozen As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
static property bool IsHeaderFrozen {
	bool get ();
	void set (bool value);
}
```

# Remarks
The setting will be written into Revit.ini if users set the value. If users start multiple Revit sessions, the schedule header frozen setting might be different in each session. Revit.ini file stores the lastest setting no matter what the Revit session is.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace